vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT633S_DFP.pdsc
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT633S.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="component.trng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.usart_adapter.condition_id">
      <require condition="allOf.driver.flexcomm, driver.flexcomm_usart, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, driver.flexcomm_usart, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MIMXRT633S.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="device_id.MIMXRT633S.internal_condition">
      <accept Dname="MIMXRT633SFAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFFOB" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFVKB" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT633S.internal_condition">
      <require condition="device_id.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="device_ids.MIMXRT633S.internal_condition">
      <accept Dname="MIMXRT633SFAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFFOB" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFVKB" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT633S.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
