vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT633S_DFP.pdsc
    <condition id="driver.cs42888.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.ctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.dialog7212.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.dmic.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.dmic_dma.condition_id">
      <require condition="allOf.driver.dmic, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dmic, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.dmic_hwvad.condition_id">
      <require condition="allOf.driver.dmic, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dmic, device_id=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmic"/>
      <require condition="device_id.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm, device_id=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2c_dma.condition_id">
      <require condition="allOf.driver.flexcomm_i2c, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2c, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_i2s_dma.condition_id">
      <require condition="allOf.driver.flexcomm_i2s, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2s, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2s"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_spi_dma.condition_id">
      <require condition="allOf.driver.flexcomm_spi, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_spi, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart.condition_id">
      <require condition="allOf.driver.flexcomm, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, device_id=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require condition="device_id.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexcomm_usart_dma.condition_id">
      <require condition="allOf.driver.flexcomm_usart, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_usart, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.flexspi_dma.condition_id">
      <require condition="allOf.driver.flexspi, driver.lpc_dma, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, driver.lpc_dma, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.fmeas.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition">
      <require condition="anyOf.driver.flexcomm_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.flexcomm_i2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
