vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT633S_DFP.pdsc
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.powerquad.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.puf.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.sema42.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MIMXRT633S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.trng.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.usdhc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S.internal_condition"/>
    </condition>
    <condition id="driver.utick.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT633S, driver.power.internal_condition"/>
    </condition>
