vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT633S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT633S_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT633S_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT633S/MIMXRT633S.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT633S/MIMXRT633S_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT633S/MIMXRT633S_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CASPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CLKCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CLKCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_DMIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_ESPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_HASHCRYPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_I2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_IOPCTL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_PMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_RSTCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_RSTCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_SPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_SYSCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_SYSCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_TRNG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USBHSD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USBHSH.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT633S/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT633S/"/>
        <file category="include" name="devices/MIMXRT633S/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT633S/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT633S/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT633S_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT633S_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/arm/MIMXRT633Sxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT633S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/arm/MIMXRT633Sxxxx_flash.scf" version="1.0.0" projectpath="MIMXRT633S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/gcc/MIMXRT633Sxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT633S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/gcc/MIMXRT633Sxxxx_flash.ld" version="1.0.0" projectpath="MIMXRT633S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/iar/MIMXRT633Sxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT633S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT633S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT633S/iar/MIMXRT633Sxxxx_flash.icf" version="1.0.0" projectpath="MIMXRT633S/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT633S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT633S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT633S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT633S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT633S/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT633S/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT633S/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT633S/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT633S/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT633S/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT633S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT633S_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT633S/iar/startup_MIMXRT633S.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT633S/gcc/startup_MIMXRT633S.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT633S/arm/startup_MIMXRT633S.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT633S_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT633S_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/system_MIMXRT633S.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT633S/system_MIMXRT633S.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT633S/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.2.4" condition="driver.casper.condition_id">
      <description>CASPER Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_casper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_casper.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.7.4" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
