vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT633S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_hwvad" Cversion="2.3.0" condition="driver.dmic_hwvad.condition_id">
      <description>DMIC HWVAD Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_dmic.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_dmic.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="driver.flexcomm.condition_id">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_flexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_flexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.3" condition="driver.flexcomm_i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.3.1" condition="driver.flexcomm_i2c_dma.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_i2c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_i2c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2s" Cversion="2.3.2" condition="driver.flexcomm_i2s.condition_id">
      <description>i2s Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_i2s.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_i2s.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2s_dma" Cversion="2.3.3" condition="driver.flexcomm_i2s_dma.condition_id">
      <description>i2s Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_i2s_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_i2s_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.2" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.2" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.5" condition="driver.flexcomm_usart.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="driver.flexcomm_usart_dma.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi" Cversion="2.8.0" condition="driver.flexspi.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_flexspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_flexspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi_dma" Cversion="2.2.1" condition="driver.flexspi_dma.condition_id">
      <description>FLEXSPI DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_flexspi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_flexspi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fmeas" Cversion="2.1.1" condition="driver.fmeas.condition_id">
      <description>FMEAS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT633S/drivers/fsl_fmeas.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT633S/drivers/fsl_fmeas.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT633S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
